Tekla Open API Reference for Tekla Structures 2025
LineTypes Explicit Conversion (Int32 to LineTypes)
 Returns the corresponding LineTypes value of the given int value.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static explicit operator LineTypes (
	int value
)
Public Shared Narrowing Operator CType (
	value As Integer
) As LineTypes
Parameters
value
Type: System.Int32
An int that corresponds to a LineTypes value.
Return Value
Type: LineTypes
A LineTypes value that corresponds with the given int.
See Also
Reference
LineTypes Class
Explicit Overload
Tekla.Structures.Drawing Namespace